import React from "react";
import "../css/components/TermsAgreement.css";

const TermsAgreement = () => {
  return (
    <div className="agreement-container">
      <div className="agreement-title">이용약관</div>
      <br />
      <div>제 1 장 총칙</div>
      <div>제1조 (목적)</div>
      <div>
        이 약관은 전기통신사업법령 및 정보통신망이용촉진 및 정보보호 등에
        관한법령에 의하여 ㈜COMAtching(이하 "COMA"라 합니다.)가 제공하는
        인터넷과 모바일 서비스 부천FC1955 (이하 "서비스"라 함) 을 이용함에 있어
        이용조건 및 절차에 관한 기본적인 사항을 규정하는 것을 목적으로 합니다.
      </div>

      <div>제2조 (약관의 효력 및 변경)</div>
      <ol>
        <li>
          이 약관은 그 내용을 COMA가 서비스 화면을 통해 게시하고 이용자가 이에
          동의 함으로써 효력을 발생합니다.
        </li>
        <li>
          COMA는 약관의 규제 등에 관한 법률, 전기통신사업법령, 정보통신망
          이용촉진 및 정보보호 등에 관한 법률 등 관련법을 위배하지 않는 범위에서
          이 약관을 개정할 수 있습니다. 단, 개정된 약관에 이의가 있는 회원은
          COMA가 정한 절차에 따라 언제든지 탈퇴할 수 있습니다.
        </li>
        <li>
          COMA가 약관을 개정할 경우, COMA는 개정약관의 적용일자 및 개정 사유를
          명시하여 현행 약관과 함께 그 적용일자 7일 이전부터 적용일자 전일까지
          서비스 화면을 통하여 공지하며 제1항과 같은 방법으로 효력이 발생합니다.
        </li>
        <li>
          약관이 개정된 경우, 개정약관은 그 적용일자 이후에 가입하는 회원에
          대하여 적용되고, 그 이전에 가입한 회원에 대하여는 당해 회원의
          가입기간에 한하여 개정 전 약관이 적용 됩니다. 단, 개정약관의 적용을
          원하는 회원의 동의절차 등 편의를 위하여 이미 가입한 회원에게는 로그인
          시 동의 여부를 확인합니다.
        </li>
      </ol>

      <div>제3조 (용어의 정의)</div>
      <div>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</div>
      <ol>
        <li>이용자 : COMA가 제공하는 서비스를 받는 가입자</li>
        <li>
          회원 : 이 약관에 따라 COMA에 개인정보를 제공하는 등 이용계약을
          체결하고 이용자 아이디(ID)를 부여 받은 자로서, COMA가 제공하는 정보를
          지속적으로 제공 받으며 COMA의 유ㆍ무선서비스 (커뮤니케이션 서비스,
          매칭 서비스 등 COMA의 모든 서비스를 포함합니다.) 및 COMA가 운영하는
          이러한 서비스를 제공하는 인터넷 사이트를 단기적으로 이용할 자
        </li>
        <li>
          QR 코드 : 해당 서비스 가입을 위해 인증해야하는 절차로, 당일 부천FC1955
          경기장에서 배부받는 경기 티켓에 표시된 QR 코드
        </li>
        <li>해지 : COMA 또는 회원이 서비스 개통 후 이용계약을 해약하는 것</li>
        <li>
          서비스 : 접속 가능한 유, 무선 단말기의 종류 및 웹사이트, 모바일
          어플리케이션 등 제공 형태와는 상관없이 당사가 제공하는 부천 Friends
          Community 및 부천 Friends Community 관련한 모든 제반 서비스를
          의미합니다.
        </li>
      </ol>

      <div>제 2 장 회원가입과 탈퇴 등</div>

      <div>제4조 (회원가입)</div>
      <ol>
        <li>
          이용자는 COMA가 정한 가입 양식에 따라 회원정보를 성실히 기입하고,
          약관에 동의 한다는 의사표시를 함으로써 회원 가입을 신청하며 COMA는
          이를 COMA가 정한 절차를 거쳐 회원으로 등록 함으로써 이용자는 회원으로
          가입하게 됩니다.
        </li>
        <li>
          일반회원의 경우는 1항의 절차만으로 그 자격이 부여 됩니다. 단,
          부천Friends Community는 법률상 미성년자는 가입 및 서비스 이용이
          제한됩니다.
        </li>
        <li>
          COMA는 제1항에 따라 회원 가입을 신청한 이용자 중 다음 각 호에 해당하는
          자에 대하여 회원등록을 거부 할 수 있습니다.
          <ol type="가">
            <li>회원 정보 기입 내용에 허위 사실, 누락, 오기가 있는 경우</li>
            <li>
              제7조에 의하여 서비스 이용의 전부 또는 일부의 제한, 정지 조치를
              받은 사실이 있거나 회원자격의 제한, 정지 또는 상실 조치를 받은
              사실이 있는 경우. 단, 회원자격 상실 후 1년이 경과한 자로서
              사이트의 회원가입 담당자로부터 회원 재가입 승낙을 얻은 경우에는
              예외로 한다.
            </li>
            <li>
              기타 회원으로 등록함으로써 COMA의 서비스에 기술상 현저히 지장이
              있다고 판단되는 경우
            </li>
          </ol>
        </li>
      </ol>

      <div>제5조 (회원정보의 변경)</div>
      <ol>
        <li>
          회원 가입 시 기입한 회원정보가 변경된 경우, 회원은 즉시 온라인으로
          직접 수정해야 하며 관리자에게 수정을 요구할 수 있습니다. 변경된
          회원정보를 수정하지 아니함으로써 발생되는 모든 책임은 회원에게
          있습니다.
        </li>
        <li>
          악용 방지를 위하여 회원 가입 정보 변경란에서 나이는 수정할 수
          없습니다.
        </li>
      </ol>

      <div>제6조 (회원의 탈퇴)</div>
      <ol>
        <li>
          회원이 탈퇴를 희망하는 경우, 회원은 언제든지 COMA에서 정한 절차에
          의하여 COMA에 대하여 탈퇴를 신청 할 수 있고, 회원의 탈퇴신청을 받은
          COMA는 탈퇴 신청일 즉시 또는 영업일 기준 익일 이내에 회원의 탈퇴조치를
          취합니다.
        </li>
        <li>
          부천 Friends Community 서비스 이용 중 회원 탈퇴를 요청할 경우 즉시
          탈퇴 처리 합니다.
        </li>
        <li>
          제1항 내지 제2항에도 불구하고, 회원이 서비스이용 중 COMA로부터 제7조에
          따른 서비스 이용의 전부 또는 일부의 정지ㆍ제한(매칭서비스 정지, 기타
          회원의 귀책사유를 원인으로 한 COMA의 회원에 대한 불이익 조치) 또는
          회원의 자격 정지ㆍ제한 조치를 받은 경우, COMA는 불이익 조치기간인
          당일에 회원의 탈퇴조치를 취합니다.
        </li>
        <li>
          회원이 스스로 탈퇴하거나 이용계약을 해지한 경우, COMA는
          정보통신망이용촉진 및 정보 보호 등에 관한 법률 기타 관계법령에 따라
          회원의 탈퇴신청일(제5항 또는 6항의 경우에는 각 경과일 또는 종료일)
          또는 해지일로부터 3개월 이내에 회원의 모든 정보를 삭제 합니다.
        </li>
        <li>
          COMA는 다음 각호에 해당하는 경우, 회원의 재가입시 당해 회원의 동일성을
          확인하기 위하여 필요한 최소한의 회원정보(sns 아이디, 나이, 성별)는
          1년간 보관 할 수 있습니다.
          <ol type="a">
            <li>
              회원이 COMA로부터 관계법령, 이 약관 등의 위반을 이유로 이용계약을
              해지 당한 경우
            </li>
            <li>
              제7조에 의하여 서비스 이용의 전부 또는 일부의 제한, 정지조치를
              받거나 회원의 자격상실, 정지 또는 제한 조치를 받은 경우
            </li>
          </ol>
        </li>
      </ol>

      <div>제7조 (회원의 자격 상실 등)</div>
      <ol>
        <li>
          회원에 대하여 다음 각호의 사유가 발생한 경우, COMA는 당해 회원의
          서비스 이용의 전부 또는 일부를 제한 또는 정지시키거나 회원의 자격을
          제한 또는 정지시킬 수 있습니다.
          <ol type="가">
            <li>
              가입 신청 시 거짓 나이 기입 후 가입 등 허위사실을 기입한 경우
            </li>
            <li>이 약관의 제13조 제3항, 제13조, 16조에 위반한 경우</li>
            <li>
              타인의 서비스 이용을 방해하거나, 타인의 명예를 훼손하거나 기타
              타인의 권리를 침해한 경우
            </li>
            <li>
              타인의 개인정보를 도용하는 등 전자거래 및 정보통신서비스
              이용질서를 위협하는 경우
            </li>
            <li>
              COMA가 제공하는 정보, 콘텐츠 등을 변경하거나 기타 방법으로 COMA의
              서비스 운영을 방해한 경우
            </li>
            <li>법률상 미성년자가 회원에 가입한 경우</li>
            <li>
              관계법령이나 이 약관 또는 선량한 풍속이나 사회질서에 위배 되는
              행위를 한 경우
            </li>
          </ol>
        </li>
        <li>
          회원이 COMA로부터 제1항에 따른 조치를 받았음에도 불구하고 시정하지
          않을 경우, COMA는 당해 회원의 자격을 상실 시킬 수 있습니다.
        </li>
        <li>
          COMA가 제2항에 따라 회원자격을 상실 시키고자 할 경우, COMA는 회원에게
          이를 통지하고 소명기회를 부여합니다. 단, 회원이 소명에 응하지
          아니하거나 소명이 부족한 때에는 당해 회원의 등록을 말소함으로써 회원의
          자격을 상실 시킵니다.
        </li>
      </ol>

      <div>제 3 장 서비스 제공 및 이용</div>

      <div>제8조 (서비스 이용시간 및 중단)</div>
      <ol>
        <li>
          서비스의 이용은 COMA가 업무상 또는 기술상 특별한 경우를 제외하고는 매
          부천FC1955 경기일자 당일 자정까지 제공하는 것을 원칙으로 합니다.
        </li>
        <li>
          COMA는 다음 각 호에 해당하는 경우 서비스 제공을 전부 또는 일부 중지할
          수 있습니다. 단 '가' 호의 경우 COMA는 제12조의 방법으로 이를 사전 또는
          사후에 공지 합니다.
          <ol type="가">
            <li>
              서비스용 설비의 관리, 정기점검, 교체, 보수 등 공사로 인한 부득이한
              경우
            </li>
            <li>
              전기통신사업법에 규정된 기간 통신사업자가 전기통신 서비스를
              중지했을 경우
            </li>
            <li>
              설비 장애 또는 이용 폭주 등으로 서비스 이용에 지장이 있는 경우
            </li>
            <li>기타 서비스의 질을 높이기 위하여 부득이한 경우</li>
          </ol>
        </li>
      </ol>

      <div>제9조 (유료정보 및 유료부가서비스의 이용)</div>
      <div>
        COMA는 이용자에게 별도의 유료정보 또는 유료부가서비스를 제공할 수
        있습니다. 다만, 유료정보 또는 유료서비스의 내용, 요금 기타 사항에
        대하여는 이용자와 별도 합의에 따릅니다.
      </div>

      <div>제10조(이용자에 대한 통지 및 고지)</div>
      <ol>
        <li>
          COMA는 회원에게 회원이 서비스 이용 중 필요하다고 인정되는 다양한
          정보를 알림 또는 기타 방법으로 제공할 수 있습니다.
        </li>
        <li>
          서비스의 이용과 관련하여 특정 회원에 대한 통지 또는 고지를 요하는
          경우, COMA는 회원이 가입 시 등록한 sns아이디로 할 수 있고, 이로써
          COMA는 그 책임을 면합니다.
        </li>
        <li>
          서비스의 이용과 관련하여 COMA는 불특정다수 회원에 대한 통지 및 고지를
          요하는 경우, 7일 이상 서비스의 게시판에 이를 게시함으로써 개별 통지
          또는 고지에 갈음할 수 있습니다. 단, 회원 본인의 서비스 이용에 관련하여
          중대한 영향을 미치는 사항에 대하여는 개별통지 합니다.
        </li>
        <li>
          COMA는 관계법률이 정한 바에 따라 정기적으로 회원에 대한 개인정보를
          수집하고 이용한 내역에 대하여 본 조의 방법에 따라 제공합니다.
        </li>
        <li>
          COMA는 회원에 대한 개인정보가 유출되거나 회원동의 없이 부정사용 된
          경우 회원에게 본 조의 방법에 따라 해당사실을 통지합니다.
        </li>
      </ol>

      <div>
        제11조 (이용자의 개인정보, 경기 티켓 QR코드 및 일련번호에 대한 의무)
      </div>
      <ol>
        <li>
          회원은 회원가입 시 현재의 사실과 일치하는 완전한 정보(이하
          "등록정보"라 한다)를 제공하여야 하고, 가입정보에 변경이 발생할 경우
          즉시 갱신하여야 합니다. 만일 가입정보의 내용이 허위(거짓 나이, 성별
          등)인 것으로 판명되거나, 그러하다고 의심할 만한 합리적인 사유가 발생할
          경우, COMA는 회원의 본 서비스 사용을 전부 또는 일부를 제한하거나
          정지시킬 수 있으며, 이로 인해 발생하는 불이익에 대하여 COMA는 그
          책임을 부담하지 아니 합니다.
        </li>
        <li>
          회원의 나이는 변경할 수 없으며, 부득이한 사유로 인하여 변경하고자 하는
          경우에는 이용계약을 해지하고 재가입하여야 합니다.
        </li>
        <li>
          회원은 정당한 이유 없이 자신의 티켓 QR코드 및 일련번호를 회원 이외의
          자에게 알려주거나 알게 하여서는 아니 됩니다.
        </li>
        <li>
          회원은 정당한 이유 없이 자신의 티켓 QR코드 및 일련번호를 회원 이외의
          자로 하여금 이용하게 하여서는 아니 됩니다.
        </li>
        <li>
          회원은 정당한 권한 없이 타인의 개인정보를 입수, 게시, 전송 하거나
          기타의 방법으로 타인의 개인 정보를 훼손, 타인의 비밀을 침해, 도용 또는
          누설하여서는 아니 됩니다. 위와 같은 행위로 인한 모든 책임은 회원이
          부담하며 COMA는 그 책임을 부담하지 아니합니다.
        </li>
        <li>
          회원의 티켓 QR코드 및 일련번호와 관련하여, COMA가 관계법령에 의해서 그
          책임을 지는 경우를 제외하고는 회원 자신의 티켓 QR코드 및 일련번호에
          관한 관리책임은 각 회원에게 있습니다.
        </li>
      </ol>

      <div>제12조 (광고 게재)</div>
      <ol>
        <li>
          COMA는 서비스의 운용과 관련하여 서비스 화면, 홈페이지 등에 광고 등을
          게재할 수 있습니다.
        </li>
        <li>
          COMA는 서비스상에 게재되어 있는 광고주의 판촉활동에 회원이 참여하거나
          거래의 결과로서 발생하는 손실 또는 손해에 대해 책임을 지지 않습니다.
        </li>
      </ol>

      <div>제13조 (지적소유권의 보호)</div>
      <ol>
        <li>
          COMA가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 모두 COMA에
          귀속하며, COMA의 사전 서면 동의 없이 서비스 외에서의 복제, 전송, 배포
          등의 일체의 이용은 금지 됩니다.
        </li>
        <li>
          회원은 COMA의 사전 서면 동의 없이 서비스를 이용하여 얻은 정보를 가공,
          판매하는 행위 등 서비스에 게재된 자료를 상업적으로 이용할 수 없습니다.
        </li>
        <li>
          COMA가 제공하는 모든 콘텐츠 및 서비스에 대해서는 회원이 본 사이트
          외에서 단순링크의 방법이나 기타 방법을 통하여 무단 전재 및 복제, 전송,
          배포하는 것은 상업적 목적여부를 불문하고 금지됩니다.
        </li>
      </ol>

      <div>제 4 장 개인정보보호</div>

      <div>제14조 (개인정보보호정책)</div>
      <div>
        COMA의 개인정보보호정책은 '정보통신망 이용촉진 및 정보보호 등에 관한
        법률'의 제규정을 준수합니다. 개인정보보호정책에 대한 보다 자세한 사항은
        사이트에 별도 고지된 '개인정보 처리방침'에서 확인하실 수 있습니다.
      </div>

      <div>제 5 장 각 당사자의 의무</div>

      <div>제15조 (COMA의 의무)</div>
      <ol>
        <li>
          COMA는 법령과 이 약관이 금지하는 행위를 하지 않으며 이 약관이 정하는
          바에 따라 지속적이고, 안정적으로 서비스를 제공하는데 최선을 다하여야
          합니다.
        </li>
        <li>
          COMA는 이용자가 안전하게 인터넷서비스를 이용할 수 있도록 이용자의
          개인정보(신용정보포함)의 보호, 관리를 위해 필요한 조치를 취합니다.
        </li>
        <li>
          COMA는 다음 각호에 해당하는 경우를 제외하고는 회원의 개인 정보를
          본인의 승낙 없이 제3자에게 누설, 배포하지 아니 합니다.
          <ol type="가">
            <li>
              전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우
            </li>
            <li>
              범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이
              있는 경우
            </li>
            <li>기타 관계법령에서 정한 절차에 따른 요청이 있는 경우</li>
          </ol>
        </li>
        <li>
          COMA는 업무와 관련하여 회원 전부 또는 일부의 개인 정보에 관한 자료를
          작성하여 이를 사용할 수 있고, 서비스를 통하여 회원의 컴퓨터에 쿠키를
          전송할 수 있습니다.
        </li>
      </ol>

      <div>제16조 (회원의 의무)</div>
      <ol>
        <li>
          회원은 이 약관에서 규정하는 모든 사항과 서비스 이용안내 및 주의사항
          등을 준수하여야 합니다.
        </li>
        <li>
          회원은 가입신청 양식에서 요구되는 내용에 관하여 진실되고 정확하며
          현재의 사실과 일치되는 완전한 정보를 제공하고 유지하여야 합니다.
        </li>
        <li>
          회원은 자신의 티켓 QR코드 및 일련번호를 관리할 의무가 있으며, 그에
          대한 회원의 관리 소홀로 인하여 발생하는 모든 책임은 회원에게 있습니다.
        </li>
        <li>
          회원은 사전 서면에 의한 동의 없이 상업적인 목적을 위하여 서비스를
          이용하여서는 아니 됩니다.
        </li>
        <li>
          이용자는 서비스를 이용함으로써 얻은 정보를 COMA의 사전 서면에 의한
          동의없이 복제, 전송, 출판, 배포, 방송 및 기타 방법으로 이용하거나
          제3자로 하여금 이용하게 하여서는 아니 됩니다.
        </li>
        <li>
          회원은 다음 각호의 행동 규범을 준수하여야 합니다.
          <ol type="가">
            <li>
              회원이 서비스를 통해 게재한 게시물 또는 콘텐츠에 대하여는 이용자가
              그 책임을 부담하게 되므로 관계법령 및 이 약관에 부합하여야 합니다.
            </li>
            <li>
              회원은 온라인.오프라인을 불문하고 타인의 권리를 침해하거나 명예를
              훼손하는 행위, 기타 불법적인 행위를 하여서는 아니 됩니다.
            </li>
            <li>
              회원은 타인의 개인정보를 수집 또는 저장하거나 이를 유용하여서는
              아니 됩니다.
            </li>
          </ol>
        </li>
        <li>
          회원의 의무는 본 조에 열거 되지 아니한 이유로 부인 되거나 경시 되지
          아니 합니다.
        </li>
      </ol>

      <div>제 6 장 기타</div>

      <div>제17조 (분쟁해결 등)</div>
      <ol>
        <li>
          COMA 및 운영사는 이용자가 제기하는 정당한 의견이나 불만을 반영하여
          적절하고 신속한 조치를 취합니다.
        </li>
        <li>
          COMA 및 운영사는 신속한 조치가 곤란한 경우, 이용자에게 그 사유와
          처리일정을 통보 할 수 있습니다.
        </li>
      </ol>

      <div>제18조 (손해배상책임)</div>
      <div>
        COMA 및 운영사는 COMA 및 운영사가 제공하는 서비스의 이용과 관련하여
        COMA의 고의 또는 중대한 과실이 없이 회원에게 발생한 손해에 대하여 그
        책임을 부담하지 아니 합니다.
      </div>

      <div>제19조 (COMA 및 운영사의 면책)</div>
      <ol>
        <li>
          COMA 및 운영사는 다음 각호에 해당하는 경우 책임을 부담하지 아니
          합니다.
          <ol type="가">
            <li>
              약관에 규정된 사유로 인하여 서비스를 제공할 수 없는 경우 서비스
              제공 불이행에 따른 책임을 COMA 및 운영사는 부담하지 않습니다.
            </li>
            <li>
              회원의 귀책사유로 인한 서비스 이용 장애에 따른 책임을 COMA 및
              운영사는 부담하지 않습니다.
            </li>
            <li>
              회원이 서비스에 게재한 정보, 자료, 신뢰성, 정확성 등 그 내용에
              따른 책임을 COMA 및 운영사는 부담하지 않습니다.
            </li>
          </ol>
        </li>
        <li>
          COMA 및 운영사는 서비스 내의 콘텐츠나 COMA의 연결 서비스가 회원의
          특정한 목적이나 필요를 충족시킨다는 보장을 하지 아니 합니다. 따라서
          회원이 이를 이용함에 있어서 품질, 성능, 정확성 등에 대한 회원의
          불만족에 대하여 COMA 및 운영사는 그 책임을 부담하지 아니합니다.
        </li>
        <li>
          부천 Friends Community 서비스 이용과 관련하여 회원간의 매칭 진행은
          당사자인 회원 간에 수행되어야 하며, COMA는 관련 진행에 관여하지
          않으며, 회원간의 귀책사유로 서비스 이용에 장애가 발생하는 것에 대해
          책임을 지지 않습니다.
        </li>
        <li>
          회원이 자신의 개인정보를 회원 개인에게 유출하거나 제공하여 발생하는
          피해에 대해 COMA는 일절 책임을 지지 않습니다.
        </li>
        <li>
          COMA의 서비스 화면에서 이루어진 매칭에 대하여 COMA는 개입하지 않으며,
          해당 매칭에 대하여 책임을 지지 않습니다.
        </li>
      </ol>

      <div>제20조 (분쟁의 처리)</div>
      <ol>
        <li>
          서비스의 이용과 관련하여 COMA와 회원 사이에 분쟁이 발생한 경우,
          당사자는 신의성실의 원칙에 따라 분쟁의 적절하고도 신속한 해결을 위하여
          서로 노력하여야 합니다.
        </li>
        <li>
          COMA 및 운영사의 고의 또는 중대한 과실에 의하여 COMA 및 운영사가
          회원에게 책임을 부담하게 된 경우, 회원은 COMA 및 운영사를 상대로 법원,
          개인정보분쟁조정위원회, 기타 제3의 기관에 그 분쟁의 해결을 신청 또는
          청구하기 전에 COMA에서 정한 절차에 따라 COMA 및 운영사에 그 분쟁의
          해결을 신청 할 수 있습니다.
        </li>
        <li>
          제2항에 의한 회원의 분쟁 해결 신청에 대하여 COMA 및 운영사로부터 60일
          이내에 COMA 및 운영사의 분쟁 해결 결과를 얻지 못하거나 그 기간 내에
          COMA 및 운영사의 분쟁 해결 결과에 승복 할 수 없는 경우, 회원은 COMA 및
          운영사를 상대로 한 법원, 개인정보분쟁조정위원회, 기타 제3의 기관에 그
          분쟁의 해결을 신청 또는 청구 할 수 있습니다.
        </li>
      </ol>

      <div>제21조 (준칙)</div>
      <div>
        이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는
        전기통신기본법, 전기통신사업법, 정보통신망이용촉진 및 정보보호 등에 관한
        법률, 기타 관계법령 또는 일반 상관례에 따릅니다.
      </div>

      <div className="terms-footer">
        [부칙]
        <br />
        이용약관 시행일자 : 2024년 10월 19일
        <br />
        Codivyright © 2024 Bucheon Friends Community All rights reserved.
      </div>
    </div>
  );
};

export default TermsAgreement;
